Show / Hide Table of Contents
Class SectionConcreteCheckResult
ection concrete result
Inheritance
System.Object
SectionConcreteCheckResult
Inherited Members
 System.Object.ToString()
 System.Object.Equals(System.Object)
 System.Object.Equals(System.Object, System.Object)
 System.Object.ReferenceEquals(System.Object, System.Object)
 System.Object.GetHashCode()
 System.Object.GetType()
 System.Object.MemberwiseClone()
Namespace: IdeaRS.OpenModel.Concrete.CheckResult
Assembly: IdeaRS.OpenModel.dll
Syntax
public class SectionConcreteCheckResult
Constructors
Improve this Doc   View Source
SectionConcreteCheckResult()
Constructor
Declaration
public SectionConcreteCheckResult()
Properties
Improve this Doc   View Source
ExtremeResults
Extreme results
Declaration
public List<ConcreteCheckResults> ExtremeResults { get; set; }
Property Value
 Type |  Description
 System.Collections.Generic.List<ConcreteCheckResults>
Improve this Doc   View Source
SectionId
Id Of section
Declaration
public int SectionId { get; set; }
Property Value
 Type |  Description
 System.Int32
 Improve this Doc
 View Source